system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       latestTime; //latestTime; startTime;

startTime       0;

stopAt          endTime;

endTime         25.0;

deltaT          5e-4;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

// libs ("libIncompressibleRASModels.so");

functions
{
 #include "forceCoeffs"
 fieldAverage1
 {
 type fieldAverage;
 functionObjectLibs ( "libfieldFunctionObjects.so" );
 enabled true;
 outputControl outputTime;
 fields
 (
 U
 {
	 mean on;
	 prime2Mean off;
	 base time;
 }
 p
 {
	 mean on;
	 prime2Mean off;
	 base time;
 }
 );
 }
}



// ************************************************************************* //
