constant/polyMesh/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}

6         
(
    bottom
    {
        type patch;
        nFaces 997;
        startFace 1730782;
    }
    cylinder
    {
        type wall;
        nFaces 196;
        startFace 1731779;
    }
    frontandback
    {
        type empty;
        nFaces 1732724;
        startFace 1731975;
    }
    inlet
    {
        type patch;
        nFaces 847;
        startFace 3464699;
    }
    outlet
    {
        type patch;
        nFaces 847;
        startFace 3465546;
    }
    top
    {
        type patch;
        nFaces 997;
        startFace 3466393;
    }
)
