0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.011 0 0);

boundaryField
{
	frontandback
    {
        type empty;
    }
    bottom
    {
        type zeroGradient;
    }
    cylinder
    {
        type fixedValue;
		value uniform (0 0 0);
    }
    inlet
    {
        type freestream;
		freestreamValue uniform (0.011 0 0);
    }
    outlet
    {
        type freestream;
		freestreamValue uniform (0.011 0 0);
    }
    top
    {
        type zeroGradient;
    }
}

// ************************************************************************* //
