system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	location 	"system";
    object      forceCoeffs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forceCoeffs
{
 type forceCoeffs;
 functionObjectLibs ( "libforces.so" );
 outputControl timeStep;
 outputInterval 1;
 patches ( "cylinder" );
 pName p;
 UName U;
 rhoName rhoInf;
 log true;

 liftDir (0 1 0);
 dragDir (1 0 0);
 CofR (0 0 0);
 pitchAxis (0 0 1);

 magUInf 0.011;
 rhoInf 1;
 lRef 1;
 Aref 1;
}

// ************************************************************************* //
